#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`failure`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.snowflake_resources.snowflake_account_role.tf_demo_reader will be created
  + resource "snowflake_account_role" "tf_demo_reader" {
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "TF_DEMO_READER"
      + show_output          = (known after apply)
    }

  # module.snowflake_resources.snowflake_database.tf_demo_database will be created
  + resource "snowflake_database" "tf_demo_database" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = 30
      + default_ddl_collation                         = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "TERRAFORM_DEMO_PROD"
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
    }

  # module.snowflake_resources.snowflake_schema.tf_demo_schema will be created
  + resource "snowflake_schema" "tf_demo_schema" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "TERRAFORM_DEMO_PROD"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "TF_DEMO"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "default"
    }

  # module.snowflake_resources.snowflake_table.demo_table will be created
  + resource "snowflake_table" "demo_table" {
      + change_tracking             = false
      + comment                     = "An empty table for Terraform demo"
      + data_retention_time_in_days = -1
      + database                    = "TERRAFORM_DEMO_PROD"
      + fully_qualified_name        = (known after apply)
      + id                          = (known after apply)
      + name                        = "DEMO_TABLE"
      + owner                       = (known after apply)
      + schema                      = "TF_DEMO"

      + column {
          + name                    = "id"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "NUMBER(38,0)"
        }
      + column {
          + name                    = "data"
          + nullable                = false
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "DATE"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "TIMESTAMP_NTZ(9)"
        }
    }

  # module.snowflake_resources.snowflake_warehouse.task_warehouse will be created
  + resource "snowflake_warehouse" "task_warehouse" {
      + auto_resume                         = "true"
      + auto_suspend                        = 1
      + enable_query_acceleration           = "default"
      + fully_qualified_name                = (known after apply)
      + id                                  = (known after apply)
      + max_concurrency_level               = (known after apply)
      + name                                = "VHOL_TASK_WAREHOUSE"
      + parameters                          = (known after apply)
      + query_acceleration_max_scale_factor = -1
      + show_output                         = (known after apply)
      + statement_queued_timeout_in_seconds = (known after apply)
      + statement_timeout_in_seconds        = (known after apply)
      + warehouse_size                      = "LARGE"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @Abhinandan90, Action: `pull_request`*